# В python есть встроенные функции bin, oct, hex, которые переводят числа в двоичную, восьмеричную и шестнадцатеричную систему счисления.
# Составить список словарей. Каждый словарь должен содержать в себе следующие пары ключ-значение:
#
# "dec" - десятичное число
# "bin" - двоичное число
# "oct" - восьмеричное число
# "hex" - шестнадцатеричное число
# Пример для десятичного числа 7:
#
# {'bin': '0b111', 'dec': 7, 'hex': '0x7', 'oct': '0o7'}
# В списке словари должны быть для чисел от 0 до 15 включительно.
# Распечатать этот список с помощью функции pprint из модуля pprint.
# TODO решить с помощью list comprehension и распечатать его
from pprint import pprint
print()
list_ = [
    {'bin': bin(i), 'dec': i, 'hex': hex(i), 'oct': oct(i)} for i in range(16)
]
pprint(list_)